app/controllers/api/v1/messages_controller.rb

INSERT INTO "messages" ("text", "uuid", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    message = Message.new(message_params)

    if message.save

SELECT "messages".* FROM "messages" WHERE "messages"."uuid" = $1 LIMIT $2  [["uuid", "64b0762193e74ce3bddfc36b406582"], ["LIMIT", 1]]
---
  def resource
    message = Message.find_by(uuid: params[:uuid])